hboughardain/MEMO-H504/PIC32CM5164LS00/NonSecure/firmware/src/packs/PIC32CM5164LS00064_DFP/component/fuses.h
/* -------- FUSES_BOCOR_WORD_1 : (FUSES Offset: 0x04) (R/W 32) BOCOR Page Word 1 -------- */
#define FUSES_BOCOR_WORD_1_RESETVALUE         _UINT32_(0xFFE80000)                                 /*  (FUSES_BOCOR_WORD_1) BOCOR Page Word 1  Reset Value */

#define FUSES_BOCOR_WORD_1_BOOTROM_BOOTOPT_Pos _UINT32_(0)                                          /* (FUSES_BOCOR_WORD_1) Boot Option Position */
#define FUSES_BOCOR_WORD_1_BOOTROM_BOOTOPT_Msk (_UINT32_(0xFF) << FUSES_BOCOR_WORD_1_BOOTROM_BOOTOPT_Pos) /* (FUSES_BOCOR_WORD_1) Boot Option Mask */
#define FUSES_BOCOR_WORD_1_BOOTROM_BOOTOPT(value) (FUSES_BOCOR_WORD_1_BOOTROM_BOOTOPT_Msk & (_UINT32_(value) << FUSES_BOCOR_WORD_1_BOOTROM_BOOTOPT_Pos)) /* Assigment of value for BOOTROM_BOOTOPT in the FUSES_BOCOR_WORD_1 register */
#define FUSES_BOCOR_WORD_1_IDAU_BOOTPROT_Pos  _UINT32_(8)                                          /* (FUSES_BOCOR_WORD_1) Boot Protection Position */
#define FUSES_BOCOR_WORD_1_IDAU_BOOTPROT_Msk  (_UINT32_(0x7FF) << FUSES_BOCOR_WORD_1_IDAU_BOOTPROT_Pos) /* (FUSES_BOCOR_WORD_1) Boot Protection Mask */
#define FUSES_BOCOR_WORD_1_IDAU_BOOTPROT(value) (FUSES_BOCOR_WORD_1_IDAU_BOOTPROT_Msk & (_UINT32_(value) << FUSES_BOCOR_WORD_1_IDAU_BOOTPROT_Pos)) /* Assigment of value for IDAU_BOOTPROT in the FUSES_BOCOR_WORD_1 register */
#define FUSES_BOCOR_WORD_1_BOOTROM_SECCFGLOCK_Pos _UINT32_(19)                                         /* (FUSES_BOCOR_WORD_1) Security Configuration Lock Position */
#define FUSES_BOCOR_WORD_1_BOOTROM_SECCFGLOCK_Msk (_UINT32_(0x1) << FUSES_BOCOR_WORD_1_BOOTROM_SECCFGLOCK_Pos) /* (FUSES_BOCOR_WORD_1) Security Configuration Lock Mask */
#define FUSES_BOCOR_WORD_1_BOOTROM_SECCFGLOCK(value) (FUSES_BOCOR_WORD_1_BOOTROM_SECCFGLOCK_Msk & (_UINT32_(value) << FUSES_BOCOR_WORD_1_BOOTROM_SECCFGLOCK_Pos)) /* Assigment of value for BOOTROM_SECCFGLOCK in the FUSES_BOCOR_WORD_1 register */
#define FUSES_BOCOR_WORD_1_BOOTROM_DICEEN_Pos _UINT32_(20)                                         /* (FUSES_BOCOR_WORD_1) DICE Enable Position */
#define FUSES_BOCOR_WORD_1_BOOTROM_DICEEN_Msk (_UINT32_(0x1) << FUSES_BOCOR_WORD_1_BOOTROM_DICEEN_Pos) /* (FUSES_BOCOR_WORD_1) DICE Enable Mask */
#define FUSES_BOCOR_WORD_1_BOOTROM_DICEEN(value) (FUSES_BOCOR_WORD_1_BOOTROM_DICEEN_Msk & (_UINT32_(value) << FUSES_BOCOR_WORD_1_BOOTROM_DICEEN_Pos)) /* Assigment of value for BOOTROM_DICEEN in the FUSES_BOCOR_WORD_1 register */
#define FUSES_BOCOR_WORD_1_NVMCTRL_BCWEN_Pos  _UINT32_(24)                                         /* (FUSES_BOCOR_WORD_1) Boot Configuration Write Enable Position */
#define FUSES_BOCOR_WORD_1_NVMCTRL_BCWEN_Msk  (_UINT32_(0x1) << FUSES_BOCOR_WORD_1_NVMCTRL_BCWEN_Pos) /* (FUSES_BOCOR_WORD_1) Boot Configuration Write Enable Mask */
#define FUSES_BOCOR_WORD_1_NVMCTRL_BCWEN(value) (FUSES_BOCOR_WORD_1_NVMCTRL_BCWEN_Msk & (_UINT32_(value) << FUSES_BOCOR_WORD_1_NVMCTRL_BCWEN_Pos)) /* Assigment of value for NVMCTRL_BCWEN in the FUSES_BOCOR_WORD_1 register */
#define FUSES_BOCOR_WORD_1_NVMCTRL_BCREN_Pos  _UINT32_(25)                                         /* (FUSES_BOCOR_WORD_1) Boot Configuration Read Enable Position */
#define FUSES_BOCOR_WORD_1_NVMCTRL_BCREN_Msk  (_UINT32_(0x1) << FUSES_BOCOR_WORD_1_NVMCTRL_BCREN_Pos) /* (FUSES_BOCOR_WORD_1) Boot Configuration Read Enable Mask */
#define FUSES_BOCOR_WORD_1_NVMCTRL_BCREN(value) (FUSES_BOCOR_WORD_1_NVMCTRL_BCREN_Msk & (_UINT32_(value) << FUSES_BOCOR_WORD_1_NVMCTRL_BCREN_Pos)) /* Assigment of value for NVMCTRL_BCREN in the FUSES_BOCOR_WORD_1 register */
#define FUSES_BOCOR_WORD_1_Msk                _UINT32_(0x031FFFFF)                                 /* (FUSES_BOCOR_WORD_1) Register Mask  */


/* -------- FUSES_BOCOR_WORD_2 : (FUSES Offset: 0x08) (R/W 32) BOCOR Page Word 2 -------- */
#define FUSES_BOCOR_WORD_2_RESETVALUE         _UINT32_(0xC0349ACC)                                 /*  (FUSES_BOCOR_WORD_2) BOCOR Page Word 2  Reset Value */

#define FUSES_BOCOR_WORD_2_BOOTROM_BOCORCRC_Pos _UINT32_(0)                                          /* (FUSES_BOCOR_WORD_2) CRC for BOCOR0 DWORD Position */
#define FUSES_BOCOR_WORD_2_BOOTROM_BOCORCRC_Msk (_UINT32_(0xFFFFFFFF) << FUSES_BOCOR_WORD_2_BOOTROM_BOCORCRC_Pos) /* (FUSES_BOCOR_WORD_2) CRC for BOCOR0 DWORD Mask */
#define FUSES_BOCOR_WORD_2_BOOTROM_BOCORCRC(value) (FUSES_BOCOR_WORD_2_BOOTROM_BOCORCRC_Msk & (_UINT32_(value) << FUSES_BOCOR_WORD_2_BOOTROM_BOCORCRC_Pos)) /* Assigment of value for BOOTROM_BOCORCRC in the FUSES_BOCOR_WORD_2 register */
#define FUSES_BOCOR_WORD_2_Msk                _UINT32_(0xFFFFFFFF)                                 /* (FUSES_BOCOR_WORD_2) Register Mask  */


/* -------- FUSES_BOCOR_WORD_4 : (FUSES Offset: 0x10) (R/W 32) BOCOR Page Word 4 -------- */
#define FUSES_BOCOR_WORD_4_RESETVALUE         _UINT32_(0xFFFFFFFF)                                 /*  (FUSES_BOCOR_WORD_4) BOCOR Page Word 4  Reset Value */

#define FUSES_BOCOR_WORD_4_BOOTROM_CEKEY0_0_Pos _UINT32_(0)                                          /* (FUSES_BOCOR_WORD_4) Chip Erase Key 0 bits 31:0 Position */
#define FUSES_BOCOR_WORD_4_BOOTROM_CEKEY0_0_Msk (_UINT32_(0xFFFFFFFF) << FUSES_BOCOR_WORD_4_BOOTROM_CEKEY0_0_Pos) /* (FUSES_BOCOR_WORD_4) Chip Erase Key 0 bits 31:0 Mask */
#define FUSES_BOCOR_WORD_4_BOOTROM_CEKEY0_0(value) (FUSES_BOCOR_WORD_4_BOOTROM_CEKEY0_0_Msk & (_UINT32_(value) << FUSES_BOCOR_WORD_4_BOOTROM_CEKEY0_0_Pos)) /* Assigment of value for BOOTROM_CEKEY0_0 in the FUSES_BOCOR_WORD_4 register */
#define FUSES_BOCOR_WORD_4_Msk                _UINT32_(0xFFFFFFFF)                                 /* (FUSES_BOCOR_WORD_4) Register Mask  */


/* -------- FUSES_BOCOR_WORD_5 : (FUSES Offset: 0x14) (R/W 32) BOCOR Page Word 5 -------- */
#define FUSES_BOCOR_WORD_5_RESETVALUE         _UINT32_(0xFFFFFFFF)                                 /*  (FUSES_BOCOR_WORD_5) BOCOR Page Word 5  Reset Value */

#define FUSES_BOCOR_WORD_5_BOOTROM_CEKEY0_1_Pos _UINT32_(0)                                          /* (FUSES_BOCOR_WORD_5) Chip Erase Key 0 bits 63:32 Position */
#define FUSES_BOCOR_WORD_5_BOOTROM_CEKEY0_1_Msk (_UINT32_(0xFFFFFFFF) << FUSES_BOCOR_WORD_5_BOOTROM_CEKEY0_1_Pos) /* (FUSES_BOCOR_WORD_5) Chip Erase Key 0 bits 63:32 Mask */
#define FUSES_BOCOR_WORD_5_BOOTROM_CEKEY0_1(value) (FUSES_BOCOR_WORD_5_BOOTROM_CEKEY0_1_Msk & (_UINT32_(value) << FUSES_BOCOR_WORD_5_BOOTROM_CEKEY0_1_Pos)) /* Assigment of value for BOOTROM_CEKEY0_1 in the FUSES_BOCOR_WORD_5 register */
#define FUSES_BOCOR_WORD_5_Msk                _UINT32_(0xFFFFFFFF)                                 /* (FUSES_BOCOR_WORD_5) Register Mask  */


/* -------- FUSES_BOCOR_WORD_6 : (FUSES Offset: 0x18) (R/W 32) BOCOR Page Word 6 -------- */
#define FUSES_BOCOR_WORD_6_RESETVALUE         _UINT32_(0xFFFFFFFF)                                 /*  (FUSES_BOCOR_WORD_6) BOCOR Page Word 6  Reset Value */

