hboughardain/MEMO-H504/PIC32CM5164LS00/NonSecure/firmware/src/packs/PIC32CM5164LS00064_DFP/component/fuses.h
#define FUSES_USER_WORD_4_NONSECA_PAC_Pos     _UINT32_(0)                                          /* (FUSES_USER_WORD_4) PAC Non-Secure Position */
#define FUSES_USER_WORD_4_NONSECA_PAC_Msk     (_UINT32_(0x1) << FUSES_USER_WORD_4_NONSECA_PAC_Pos) /* (FUSES_USER_WORD_4) PAC Non-Secure Mask */
#define FUSES_USER_WORD_4_NONSECA_PAC(value)  (FUSES_USER_WORD_4_NONSECA_PAC_Msk & (_UINT32_(value) << FUSES_USER_WORD_4_NONSECA_PAC_Pos)) /* Assigment of value for NONSECA_PAC in the FUSES_USER_WORD_4 register */
#define FUSES_USER_WORD_4_NONSECA_PM_Pos      _UINT32_(1)                                          /* (FUSES_USER_WORD_4) PM Non-Secure Position */
#define FUSES_USER_WORD_4_NONSECA_PM_Msk      (_UINT32_(0x1) << FUSES_USER_WORD_4_NONSECA_PM_Pos)  /* (FUSES_USER_WORD_4) PM Non-Secure Mask */
#define FUSES_USER_WORD_4_NONSECA_PM(value)   (FUSES_USER_WORD_4_NONSECA_PM_Msk & (_UINT32_(value) << FUSES_USER_WORD_4_NONSECA_PM_Pos)) /* Assigment of value for NONSECA_PM in the FUSES_USER_WORD_4 register */
#define FUSES_USER_WORD_4_NONSECA_MCLK_Pos    _UINT32_(2)                                          /* (FUSES_USER_WORD_4) MCLK Non-Secure Position */
#define FUSES_USER_WORD_4_NONSECA_MCLK_Msk    (_UINT32_(0x1) << FUSES_USER_WORD_4_NONSECA_MCLK_Pos) /* (FUSES_USER_WORD_4) MCLK Non-Secure Mask */
#define FUSES_USER_WORD_4_NONSECA_MCLK(value) (FUSES_USER_WORD_4_NONSECA_MCLK_Msk & (_UINT32_(value) << FUSES_USER_WORD_4_NONSECA_MCLK_Pos)) /* Assigment of value for NONSECA_MCLK in the FUSES_USER_WORD_4 register */
#define FUSES_USER_WORD_4_NONSECA_RSTC_Pos    _UINT32_(3)                                          /* (FUSES_USER_WORD_4) RSTC Non-Secure Position */
#define FUSES_USER_WORD_4_NONSECA_RSTC_Msk    (_UINT32_(0x1) << FUSES_USER_WORD_4_NONSECA_RSTC_Pos) /* (FUSES_USER_WORD_4) RSTC Non-Secure Mask */
#define FUSES_USER_WORD_4_NONSECA_RSTC(value) (FUSES_USER_WORD_4_NONSECA_RSTC_Msk & (_UINT32_(value) << FUSES_USER_WORD_4_NONSECA_RSTC_Pos)) /* Assigment of value for NONSECA_RSTC in the FUSES_USER_WORD_4 register */
#define FUSES_USER_WORD_4_NONSECA_OSCCTRL_Pos _UINT32_(4)                                          /* (FUSES_USER_WORD_4) OSCCTRL Non-Secure Position */
#define FUSES_USER_WORD_4_NONSECA_OSCCTRL_Msk (_UINT32_(0x1) << FUSES_USER_WORD_4_NONSECA_OSCCTRL_Pos) /* (FUSES_USER_WORD_4) OSCCTRL Non-Secure Mask */
#define FUSES_USER_WORD_4_NONSECA_OSCCTRL(value) (FUSES_USER_WORD_4_NONSECA_OSCCTRL_Msk & (_UINT32_(value) << FUSES_USER_WORD_4_NONSECA_OSCCTRL_Pos)) /* Assigment of value for NONSECA_OSCCTRL in the FUSES_USER_WORD_4 register */
#define FUSES_USER_WORD_4_NONSECA_OSC32KCTRL_Pos _UINT32_(5)                                          /* (FUSES_USER_WORD_4) OSC32KCTRL Non-Secure Position */
#define FUSES_USER_WORD_4_NONSECA_OSC32KCTRL_Msk (_UINT32_(0x1) << FUSES_USER_WORD_4_NONSECA_OSC32KCTRL_Pos) /* (FUSES_USER_WORD_4) OSC32KCTRL Non-Secure Mask */
#define FUSES_USER_WORD_4_NONSECA_OSC32KCTRL(value) (FUSES_USER_WORD_4_NONSECA_OSC32KCTRL_Msk & (_UINT32_(value) << FUSES_USER_WORD_4_NONSECA_OSC32KCTRL_Pos)) /* Assigment of value for NONSECA_OSC32KCTRL in the FUSES_USER_WORD_4 register */
#define FUSES_USER_WORD_4_NONSECA_SUPC_Pos    _UINT32_(6)                                          /* (FUSES_USER_WORD_4) SUPC Non-Secure Position */
#define FUSES_USER_WORD_4_NONSECA_SUPC_Msk    (_UINT32_(0x1) << FUSES_USER_WORD_4_NONSECA_SUPC_Pos) /* (FUSES_USER_WORD_4) SUPC Non-Secure Mask */
#define FUSES_USER_WORD_4_NONSECA_SUPC(value) (FUSES_USER_WORD_4_NONSECA_SUPC_Msk & (_UINT32_(value) << FUSES_USER_WORD_4_NONSECA_SUPC_Pos)) /* Assigment of value for NONSECA_SUPC in the FUSES_USER_WORD_4 register */
#define FUSES_USER_WORD_4_NONSECA_GCLK_Pos    _UINT32_(7)                                          /* (FUSES_USER_WORD_4) GCLK Non-Secure Position */
#define FUSES_USER_WORD_4_NONSECA_GCLK_Msk    (_UINT32_(0x1) << FUSES_USER_WORD_4_NONSECA_GCLK_Pos) /* (FUSES_USER_WORD_4) GCLK Non-Secure Mask */
#define FUSES_USER_WORD_4_NONSECA_GCLK(value) (FUSES_USER_WORD_4_NONSECA_GCLK_Msk & (_UINT32_(value) << FUSES_USER_WORD_4_NONSECA_GCLK_Pos)) /* Assigment of value for NONSECA_GCLK in the FUSES_USER_WORD_4 register */
#define FUSES_USER_WORD_4_NONSECA_WDT_Pos     _UINT32_(8)                                          /* (FUSES_USER_WORD_4) WDT Non-Secure Position */
#define FUSES_USER_WORD_4_NONSECA_WDT_Msk     (_UINT32_(0x1) << FUSES_USER_WORD_4_NONSECA_WDT_Pos) /* (FUSES_USER_WORD_4) WDT Non-Secure Mask */
#define FUSES_USER_WORD_4_NONSECA_WDT(value)  (FUSES_USER_WORD_4_NONSECA_WDT_Msk & (_UINT32_(value) << FUSES_USER_WORD_4_NONSECA_WDT_Pos)) /* Assigment of value for NONSECA_WDT in the FUSES_USER_WORD_4 register */
#define FUSES_USER_WORD_4_NONSECA_RTC_Pos     _UINT32_(9)                                          /* (FUSES_USER_WORD_4) RTC Non-Secure Position */
#define FUSES_USER_WORD_4_NONSECA_RTC_Msk     (_UINT32_(0x1) << FUSES_USER_WORD_4_NONSECA_RTC_Pos) /* (FUSES_USER_WORD_4) RTC Non-Secure Mask */
#define FUSES_USER_WORD_4_NONSECA_RTC(value)  (FUSES_USER_WORD_4_NONSECA_RTC_Msk & (_UINT32_(value) << FUSES_USER_WORD_4_NONSECA_RTC_Pos)) /* Assigment of value for NONSECA_RTC in the FUSES_USER_WORD_4 register */
#define FUSES_USER_WORD_4_NONSECA_EIC_Pos     _UINT32_(10)                                         /* (FUSES_USER_WORD_4) EIC Non-Secure Position */
#define FUSES_USER_WORD_4_NONSECA_EIC_Msk     (_UINT32_(0x1) << FUSES_USER_WORD_4_NONSECA_EIC_Pos) /* (FUSES_USER_WORD_4) EIC Non-Secure Mask */
#define FUSES_USER_WORD_4_NONSECA_EIC(value)  (FUSES_USER_WORD_4_NONSECA_EIC_Msk & (_UINT32_(value) << FUSES_USER_WORD_4_NONSECA_EIC_Pos)) /* Assigment of value for NONSECA_EIC in the FUSES_USER_WORD_4 register */
#define FUSES_USER_WORD_4_NONSECA_FREQM_Pos   _UINT32_(11)                                         /* (FUSES_USER_WORD_4) FREQM Non-Secure Position */
#define FUSES_USER_WORD_4_NONSECA_FREQM_Msk   (_UINT32_(0x1) << FUSES_USER_WORD_4_NONSECA_FREQM_Pos) /* (FUSES_USER_WORD_4) FREQM Non-Secure Mask */
#define FUSES_USER_WORD_4_NONSECA_FREQM(value) (FUSES_USER_WORD_4_NONSECA_FREQM_Msk & (_UINT32_(value) << FUSES_USER_WORD_4_NONSECA_FREQM_Pos)) /* Assigment of value for NONSECA_FREQM in the FUSES_USER_WORD_4 register */
#define FUSES_USER_WORD_4_NONSECA_PORT_Pos    _UINT32_(12)                                         /* (FUSES_USER_WORD_4) PORT Non-Secure Position */
#define FUSES_USER_WORD_4_NONSECA_PORT_Msk    (_UINT32_(0x1) << FUSES_USER_WORD_4_NONSECA_PORT_Pos) /* (FUSES_USER_WORD_4) PORT Non-Secure Mask */
#define FUSES_USER_WORD_4_NONSECA_PORT(value) (FUSES_USER_WORD_4_NONSECA_PORT_Msk & (_UINT32_(value) << FUSES_USER_WORD_4_NONSECA_PORT_Pos)) /* Assigment of value for NONSECA_PORT in the FUSES_USER_WORD_4 register */
#define FUSES_USER_WORD_4_NONSECA_AC_Pos      _UINT32_(13)                                         /* (FUSES_USER_WORD_4) AC Non-Secure Position */
#define FUSES_USER_WORD_4_NONSECA_AC_Msk      (_UINT32_(0x1) << FUSES_USER_WORD_4_NONSECA_AC_Pos)  /* (FUSES_USER_WORD_4) AC Non-Secure Mask */
#define FUSES_USER_WORD_4_NONSECA_AC(value)   (FUSES_USER_WORD_4_NONSECA_AC_Msk & (_UINT32_(value) << FUSES_USER_WORD_4_NONSECA_AC_Pos)) /* Assigment of value for NONSECA_AC in the FUSES_USER_WORD_4 register */
#define FUSES_USER_WORD_4_Msk                 _UINT32_(0x00003FFF)                                 /* (FUSES_USER_WORD_4) Register Mask  */


